## Plan Result (sds_prod_ado)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_polybasestaging_owner[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_polybasestaging_owner[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "66f94809-0bdf-4677-b861-a827beea0d0c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sds_prod_ado","Vars":{}} -->